Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
# -*- mode: org -*-
#+DATE: 2016-06-22
#+TITLE: Documenting Program indent : An Example
#+AUTHOR: Prabhaker Mateti
#+DESCRIPTION: CEG7380 Cloud Computing
#+HTML_LINK_UP: ../
#+HTML_LINK_HOME: ../../
#+HTML_HEAD: <style> P {text-align: justify} code, pre {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2016 %e &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:2

#+begin_src text

             Documenting Program indent : An Example


                         Prabhaker Mateti

          Department of Computer Engineering and Science
                 Case Western Reserve University
                      Cleveland, Ohio 44106


                   Thu Nov 29 10:56:01 EST 1984
#+end_src

* Abstract

         This report constitutes the documentation for  a  simple
 minded   pretty-printing  program,  called  indent,  for  Pascal
 programs.  The program's main attraction lies in its ability  to
 'sensibly' indent even invalid Pascal programs.

 >>         This report is an (imperfect) example of how programs
 ought to be documented.

         Because we intend this as a model for documentations, we
 also  include discussions of why certain sections are written in
 a certain way.  These are obviously not expected to be found  in
 a real documentation.  We enclose such discussions in the >>  <<
 bracket pair.

         More technically inclined people may also wish  to  read
 the  two papers, "A Specification Schema for Indenting Programs"
 and "A Correctness Proof of an Indenting Program", published  in
 Software  --  Practice  and Experience 1983, pp 163-179 and 199 - 226.  <<




* Requirements

         A program to read a file of Pascal source, and print  it
 nicely  formatted is required.  Many pretty-printing schemes for
 Pascal have appeared in various text books, e.g., "Oh!  Pascal!"
 by  Cooper and Clancy.  Any such reasonable scheme is acceptable
 to us.  In addition, we also want the program to indent sensibly
 Pascal files that contain syntax errors.

 Some further requirements are stated below.


** 1  Pascal Dialects

         The indent program must deal with standard (ISO)  Pascal
 properly.   While  doing  this,  if  it  can also handle certain
 extensions that is quite welcome.  In particular we mention  the
 following  extensions  which appear to be common enough and also
 affect the lay out: a loop construct with middle exit (so-called
 n-and-a-half  loop), a default case label in the case statement,
 and some form of module structuring.


** 2  Robustness

         Forgotten begin-ends causing certain statements  to  not
 belong  to  loop  bodies and other such errors are quite common.
 Such omissions may even become syntax  errors.   Thus,  we  want
 this  indenting  program  to  terminate  normally as long as the
 input file contains text (i.e., a sequence of lines of printable
 ascii  characters).   We  also  want  the program to process the
 entire input text no matter what syntax errors it might contain.
 In  all  cases,  the  text  output coming from this program must
 appear to a Pascal compiler to be the same as input text.


** 3  Implementation Language

         The indent program should be written in either Pascal or
 C.  We mention C only because we expect the indent program to be
 heavily used on Unix systems.  The implementation in Pascal must
 limit  itself strictly to standard Pascal.  Consideration should
 also  be  given  to  certain   highly   varying   implementation
 idiosyncracies,  such  as  the  details  of  sets,  integers and
 strings and make indent highly portable.


** 4  Speed

         The indent program should be quite fast; we expect it to
 be  slower than a straightforward catenating (Unix cat) program,
 but much faster than a compiler for Pascal.  Since this  is  too
 loose a requirement, we elaborate further.

 The speed of indent should be proportional  to  the  length  (in
 characters)  of  the  input  file.   We  also require that every
 effort be made to keep the constant  of  proportionality  small.
 It  is  understood  that  this  constant  depends  on  the given
 computer system, and on the required processing in dealing  with
 syntactically  incorrect  Pascal  input  files.   It is for this
 reason that the Pascal compiler, and cat programs are  mentioned
 above to serve as bounds.


** 4  Memory

         It is important that not  only  the  indent  program  be
 short,  but  the  data  space  required  also  should  be small.
 Assuming that the nesting of various constructs  is  limited  to
 realistic level (say 100), we do not see any reason why the data
 space required cannot be a fixed constant.


** 5  Customizability

         As can be seen from the above, we have left the  details
 of  the  indentation scheme to the designer of indent.  However,
 we also urge that certain minor customizations in this scheme be
 permitted.   This  the  designer  may  choose  to provide either
 through the '{$'-comments, or perhaps through  changing  certain
 constants  in  the  indenting  program and recompiling it.  What
 features will be customizable should be considered  against  the
 increase in the length and complexity of the indent program.  As
 a guiding rule, if this increase is perceived to  be  more  than
 10%, we recommend the trimming of the attempted customization.




