Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Documenting Program indent : An Example</title>
<!-- 2016-06-24 Fri 15:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Documenting Program indent : An Example</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Abstract</a></li>
<li><a href="#sec-2">2. Requirements</a>
<ul>
<li><a href="#sec-2-1">2.1. 1  Pascal Dialects</a></li>
<li><a href="#sec-2-2">2.2. 2  Robustness</a></li>
<li><a href="#sec-2-3">2.3. 3  Implementation Language</a></li>
<li><a href="#sec-2-4">2.4. 4  Speed</a></li>
<li><a href="#sec-2-5">2.5. 4  Memory</a></li>
<li><a href="#sec-2-6">2.6. 5  Customizability</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Specifications</a>
<ul>
<li><a href="#sec-3-1">3.1. 1  Global Functional Specs</a></li>
<li><a href="#sec-3-2">3.2. 2  Proper Layout</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Design</a>
<ul>
<li><a href="#sec-4-1">4.1. 1  Central Ideas In the Design</a></li>
<li><a href="#sec-4-2">4.2. 1.1  Tokens</a></li>
<li><a href="#sec-4-3">4.3. 1.2  'Reduced' Token Sequences</a></li>
<li><a href="#sec-4-4">4.4. 1.3  Correspondence Between Input and Output Lines</a></li>
<li><a href="#sec-4-5">4.5. 1.4  Left Margin</a></li>
<li><a href="#sec-4-6">4.6. 2  Overview of the Design</a></li>
<li><a href="#sec-4-7">4.7. I2.1  The Buffer and its Indices</a></li>
<li><a href="#sec-4-8">4.8. 2.2  Lexical Equivalence of I/O</a></li>
<li><a href="#sec-4-9">4.9. 2.3  Margin Variables</a></li>
<li><a href="#sec-4-10">4.10. 2.4  Computing the Indentation</a></li>
<li><a href="#sec-4-11">4.11. 3  Detailed Design</a></li>
<li><a href="#sec-4-12">4.12. 3.1  Properties of the Buffer</a></li>
<li><a href="#sec-4-13">4.13. Immediately after a (part of) line is output, fromx  is  updated</a></li>
<li><a href="#sec-4-14">4.14. 3.2  io Module</a></li>
<li><a href="#sec-4-15">4.15. 3.3  lex Module</a></li>
<li><a href="#sec-4-16">4.16. 3.4  stack Module</a></li>
<li><a href="#sec-4-17">4.17. 3.7  indent Module</a></li>
<li><a href="#sec-4-18">4.18. 3.2  Compute Reduced Sequence and Margins</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Implementation</a>
<ul>
<li><a href="#sec-5-1">5.1. 1  Some Global Considerations</a></li>
<li><a href="#sec-5-2">5.2. 2  Initialization</a></li>
<li><a href="#sec-5-3">5.3. 3  lex Module</a></li>
<li><a href="#sec-5-4">5.4. 3.1  Next Token of lex Module</a></li>
<li><a href="#sec-5-5">5.5. 3.2  Lexeme-Token Tables</a></li>
<li><a href="#sec-5-6">5.6. 4  Other Modules</a></li>
<li><a href="#sec-5-7">5.7. 5  Comments on the Pascal Version</a></li>
<li><a href="#sec-5-8">5.8. 6  Comments on the C Version</a></li>
</ul>
</li>
<li><a href="#sec-6">6. D. User's Manual</a></li>
<li><a href="#sec-7">7. E. Customization Notes</a></li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-text">   Documenting Program indent : An Example


               Prabhaker Mateti

Department of Computer Engineering and Science
       Case Western Reserve University
            Cleveland, Ohio 44106


         Thu Nov 29 10:56:01 EST 1984
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
        This report constitutes the documentation for  a  simple
minded   pretty-printing  program,  called  indent,  for  Pascal
programs.  The program's main attraction lies in its ability  to
'sensibly' indent even invalid Pascal programs.
</p>

<p>
&gt;&gt;         This report is an (imperfect) example of how programs
ought to be documented.
</p>

<p>
        Because we intend this as a model for documentations, we
also  include discussions of why certain sections are written in
a certain way.  These are obviously not expected to be found  in
a real documentation.  We enclose such discussions in the &gt;&gt;  &lt;&lt;
bracket pair.
</p>

<p>
        More technically inclined people may also wish  to  read
the  two papers, "A Specification Schema for Indenting Programs"
and "A Correctness Proof of an Indenting Program", published  in
Software  &#x2013;  Practice  and Experience 1983, pp 163-179 and 199 - 226.  &lt;&lt;
</p>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
        A program to read a file of Pascal source, and print  it
nicely  formatted is required.  Many pretty-printing schemes for
Pascal have appeared in various text books, e.g., "Oh!  Pascal!"
by  Cooper and Clancy.  Any such reasonable scheme is acceptable
to us.  In addition, we also want the program to indent sensibly
Pascal files that contain syntax errors.
</p>

<p>
Some further requirements are stated below.
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 1  Pascal Dialects</h3>
<div class="outline-text-3" id="text-2-1">
<p>
        The indent program must deal with standard (ISO)  Pascal
properly.   While  doing  this,  if  it  can also handle certain
extensions that is quite welcome.  In particular we mention  the
following  extensions  which appear to be common enough and also
affect the lay out: a loop construct with middle exit (so-called
n-and-a-half  loop), a default case label in the case statement,
and some form of module structuring.
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 2  Robustness</h3>
<div class="outline-text-3" id="text-2-2">
<p>
        Forgotten begin-ends causing certain statements  to  not
belong  to  loop  bodies and other such errors are quite common.
Such omissions may even become syntax  errors.   Thus,  we  want
this  indenting  program  to  terminate  normally as long as the
input file contains text (i.e., a sequence of lines of printable
ascii  characters).   We  also  want  the program to process the
entire input text no matter what syntax errors it might contain.
In  all  cases,  the  text  output coming from this program must
appear to a Pascal compiler to be the same as input text.
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 3  Implementation Language</h3>
<div class="outline-text-3" id="text-2-3">
<p>
        The indent program should be written in either Pascal or
C.  We mention C only because we expect the indent program to be
heavily used on Unix systems.  The implementation in Pascal must
limit  itself strictly to standard Pascal.  Consideration should
also  be  given  to  certain   highly   varying   implementation
idiosyncracies,  such  as  the  details  of  sets,  integers and
strings and make indent highly portable.
</p>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 4  Speed</h3>
<div class="outline-text-3" id="text-2-4">
<p>
        The indent program should be quite fast; we expect it to
be  slower than a straightforward catenating (Unix cat) program,
but much faster than a compiler for Pascal.  Since this  is  too
loose a requirement, we elaborate further.
</p>

<p>
The speed of indent should be proportional  to  the  length  (in
characters)  of  the  input  file.   We  also require that every
effort be made to keep the constant  of  proportionality  small.
It  is  understood  that  this  constant  depends  on  the given
computer system, and on the required processing in dealing  with
syntactically  incorrect  Pascal  input  files.   It is for this
reason that the Pascal compiler, and cat programs are  mentioned
above to serve as bounds.
</p>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 4  Memory</h3>
<div class="outline-text-3" id="text-2-5">
<p>
        It is important that not  only  the  indent  program  be
short,  but  the  data  space  required  also  should  be small.
Assuming that the nesting of various constructs  is  limited  to
realistic level (say 100), we do not see any reason why the data
space required cannot be a fixed constant.
</p>
</div>
</div>


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 5  Customizability</h3>
<div class="outline-text-3" id="text-2-6">
<p>
        As can be seen from the above, we have left the  details
of  the  indentation scheme to the designer of indent.  However,
we also urge that certain minor customizations in this scheme be
permitted.   This  the  designer  may  choose  to provide either
through the '{$'-comments, or perhaps through  changing  certain
constants  in  the  indenting  program and recompiling it.  What
features will be customizable should be considered  against  the
increase in the length and complexity of the indent program.  As
a guiding rule, if this increase is perceived to  be  more  than
10%, we recommend the trimming of the attempted customization.
</p>
</div>
</div>
</div>
