Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
* Specifications

 >>      This chapter on Specifications contains a description of
 the programmer's understanding of the user's requirements.  Even
 if we wish to ignore for the moment  possible  misunderstandings
 of  the  requirements, we must admit that the specifications are
 not precise enough.  Contrary to  popular  belief,  even  formal
 specifications  can be imprecise and/or inconsistent.  It is for
 this main reason that certain important  perceived  implications
 of the specs need to be discussed.

 <<

         We clarify first some of our terminology.

         The  characters  blank,  tab,  vertical  tab,   carriage
 return,  and line feed are said to be "white" because they cause
 only carriage motion, but otherwise do not "print" on a printer.
 In  Pascal,  white  characters  act  as  delimiters (except when
 inside strings), and have no further effect.

 To  simplify  the  specifications,  we  assume  that  all  white
 characters  except  blank,  and  a  'newline'  are  replaced  by
 blank(s).  The newline denoted by \n, is system  dependent.   On
 Unix,  it  is  a line feed; on most other systems, it stands for
 the two character sequence of carriage return followed  by  line
 feed.

         A line is a sequence of non-newline characters  followed
 by a newline.

         A text file is a sequence of lines, followed by an  end-
 of-file indicator.

 >>      Parsing as it is dealt with in  compiler  courses  deals
 with  lexical  units  known  as  'tokens'.   This  ignores white
 spaces.  But, in a specification of an indenting program we must
 deal especially with this.  <<

         Reserved  words,  identifiers,   non-white   delimiters,
 strings  and  operators  are  tokens.   We  use the related term
 lexeme to refer to the string of characters  that  constitute  a
 token.   Thus,  "buffer"  and  "nooftokens"  are both identifier
 tokens, but are different lexemes.


** 1  Global Functional Specs

 (1) The output produced by the  program  and  the  input  given,
 considered  as  lexeme  sequences, must be equal.  This equality
 must hold whether or not the input file contains a syntactically
 valid Pascal program.

 (2) If the input file  contains  a  valid  Pascal  program,  the
 output  file  produced  from it must be properly laid out with a
 margin of zero, as defined in the next section.

 (3) For every line break (between/before/after lexemes)  of  the
 input  a  corresponding  unique line break (between/before/after
 the same two lexemes) must exist in the output.

 (4) Apart from any needed  changes  in  its  white  spaces,  the
 position  of  every  comment relative to its neighboring lexemes
 must remain unchanged.

 (5) The output file, considered as a sequence of characters,  is
 the shortest such file having these properties.

 As a result of (5), we can conclude that if the input is already
 properly  laid out, the output must be identical (as a character
 sequence) to it.


** 2  Proper Layout

         Note that the above specification requires  the  program
 to  produce  'properly  laid out' output for syntactically valid
 text inputs.  For ill-formed inputs, the format of the output is
 essentially  left  to  the  judgement of the designer.  However,
 some guidelines have already been presented in the Requirements.

 >>      The specification of proper layout cannot  be  given  by
 means  of examples.  It must necessarily be syntax-directed.  We
 believe only minor improvements over the notation  used  in  our
 specifications to be possible.  <<

         Proper layout is specified using the Pascal grammar; see
 Figure  1.   Each  production  of  the  grammar is laid out in a
 particular way, which merely acts as a short hand  notation  for
 our  specifications.  The long hand specification is obtained by
 'reading it out' as explained below.  This is explained using  a
 generic  form  of  a  production  rule  n0 ::= n1 n2 ... nk.  In
 general, some of these ni will be tokens.  Our  exposition  will
 be  simpler  if  all  these ni were non-terminals.  We make this
 happen by replacing lexemes by  unique  non-terminals,  such  as
 ntSEMICOLON.

         Suppose s0 is a string of characters derivable from  n0,
 that is n0 ->* s0, using this as the first production.  Hence it
 must be possible to split s0 up into s1, s2, ..., sk so that for
 each  i,  ni ->* si.  Since we intend to specify left margins of
 various lines, we will split the s0 in such a way that the  last
 character  of  no si is white.  Consequently, many of the si may
 contain leading white spaces.  It is the length of  these  white
 spaces that we wish to legislate.

         The rhs n1 n2 ... nk of the production is  laid  out  2-
 dimensionally  so  that no line contains more than one ni.  Each
 ni is written to the right of a reference vertical  line,  at  a
 certain  distance  that depends on ni and this whole production.
 This distance is the the reference vertical, some of the ni  may
 contain the notation '\n'.

#+begin_src text
 n0 ::=
         |   n1
       \n|      n2
         |  n3
         |   ...
         |   ...
         |   ...
         |   nk
#+end_src

 Such a layout of a production rule is  interpreted  as  follows.
 The  string  s0,  derived  from n0, is considered to be laid out
 properly with a margin of m provided --

 (1) each si is properly laid out with a margin of m + ri.

 (2) for each ni having  a  \n  to  the  left  of  the  reference
 vertical,  the  corresponding  si  is such that it begins with a
 white space containing a new line character.

         Note the recursion in step (1) of the definition.   This
 recursion  ends  when  we  finally have a non-terminal that just
 stands for one of the lexemes of Pascal.

 If  the  ni  is  an  original  non-terminal,  the  layout  of  a
 production  with ni on the lhs determines if si is properly laid
 out.

 Else, ni just stands for a lexeme, say t.  Then si is defined to
 be   properly   laid  out  either  if  it  contains  no  newline
 characters,  or  if  its  first   non-white   character   occurs
 immediately  following  a  newline  followed by m+ri blanks.  In
 symbols, this last case can be described as

         si = %* | \n | b ** (m+ri) | t,

 where % denotes any white character (including newlines), and  b
 denotes a blank.





* Design


         Our design of this program is described in three  levels
 of  detail.   The first one may be viewed as a refinement of the
 specifications given before.  The second one is an  overview  of
 the  design.   The last one is much more detailed, and specifies
 which routines do what.  The justification of the design appears
 at  appropriate  places throughout this chapter.  These sections
 should be read in the order in which they are presented.


