Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
** 1  Central Ideas In the Design

         Specification  S1  clearly  demands  that  the   program
 terminate  cleanly  even  when  the  input  file contains syntax
 errors.  It was also pointed  out  in  Further  Guidelines  that
 sensible  indentation  helps  us  readily  notice certain syntax
 errors.   Also,  elaborate  error  messages  from  an  indenting
 program  are  out of place.  To meet these needs, our design has
 to generalize syntax correctness to a more permissive one.

         In  this  section,  we  make  the  notion  of   sensible
 indentation, in the presence of syntax errors, more precise, and
 present the central ideas  in  the  design.   An  example  of  a
 properly  laid  out, but syntactically invalid, function appears
 in Figure 2.

         We generalize the notion of  correct  Pascal  syntax  to
 token  sequences "reducible" to null.  All valid Pascal programs
 will be so reducible; however, not all null-reducible  sequences
 are  valid  Pascal programs.  The computation of the left margin
 of a line depends on the reduced  form  of  the  token  sequence
 above this line.

         The motivation for considering this reduction comes from
 a  desire  to  make  the program as simple and short as possible
 while treating valid Pascal programs  "properly."   This  desire
 caused  us  to avoid detailed syntax analysis.  Instead, we rely
 on the fact that in a syntactically correct Pascal program,  the
 nesting  structure  is  governed  by  a  rather  small number of
 reserved words.  Our design would have been  simpler  if  Pascal
 had explicit "end-brackets" for every "composite" statement.


** 1.1  Tokens

         Our lexical analysis in this program does not match that
 of a typical Pascal compiler for the following reasons:

 (1) We have to deal with the formatting of comments,  which  are
 ignored by a compiler.

 (2) Because the indent-specifications for valid Pascal  programs
 of  the  previous  section  require no changes in the margin for
 identifiers, literals, and operators, we do need only treat them
 all  to  belong  to an ORDINARY class of tokens.  This choice in
 our design significantly increases the speed of this program.


** 1.2  'Reduced' Token Sequences

         Intuitively, a token sequence T1 followed by T3 (written
 as  T1.T3)  is a reduced token sequence of T1.T2.T3 if T2 is the
 token sequence of a syntactically 'sensible' or  correct  Pascal
 statement.

         At all times, we maintain a reduced form (call it R)  of
 the  sequence  of input tokens (say T) processed.  Notationally,
 we shall express this fact by writing R = RED(T).   Now  suppose
 the  next  token is t.  The reduction of T.t is computed from R.
 (At the very beginning both T and R are null sequences.)

         If t is an identifier, a  string,  or  an  operator  the
 reduction of T as well as that of T.t is R.

         Some of the reserved words and non-white delimiters  are
 considered "brackets."  The tokens REPEAT, DO, BEGIN, CASE, THEN
 and left  parenthesis  are  considered  opening  brackets.   The
 tokens  UNTIL,  semicolon,  END,  ELSE  are  considered  closing
 brackets.  Each opening bracket appearing in a Pascal program is
 matched  by  a  closing  bracket.   (Unfortunately,  the closing
 bracket is not unique to a given opening bracket.)

         The reduction of T.t when t is  an  opening  bracket  is
 R.t.

         The reduction of T.t when t is a closing  bracket  is  a
 unique  prefix  (i.e.,  an  initial subsequence), say P, of R so
 that P.x.Q = T and x is the right most opening bracket  matching
 t.   If R has no such x we reduce it to the null sequence.  That
 is R is scanned leftward, discarding what has been scanned over,
 while  a matching opening bracket is not found.  However, as the
 closing brackets are neither unique, nor do  they  "match"  only
 one occurrence of their matching opening bracket, the details of
 this process need to be worked out carefully  (see Section 3.2).

         These details are such that the  reduction  of  a  valid
 Pascal statement, or complete program is the null sequence.


** 1.3  Correspondence Between Input and Output Lines

         Each input line must produce  some  integral  number  of
 output lines, because of specification S3.

         The definition of proper lay out is  such  that  certain
 tokens  are  required  to appear only at the beginning of lines,
 and certain others only at the end of  statements.   Note  that,
 fortunately,  this  specification does not depend on the context
 in which these tokens appear.

         Consequently, in our design, the correspondence  between
 input and output is governed by two sets of tokens.  The LO is a
 set of tokens that should always appear  at  the  beginning  and
 never  in the middle of an output line.  The LC is a set of line
 closing tokens  that  should  always  appear  in  a  terminating
 position  of  an  output  line.   If necessary, we may split the
 input line to the immediate left of  an  LO  token,  or  to  the
 immediate  right  of  an  LC  token in order to accomplish this.
 However, traditionally we are used to writing  comments  at  the
 end  of  statements.  Thus, we modify the above to splitting the
 line to the immediate right of an LC  token  but  skipping  over
 comments.

 LO and LC can be chosen arbitrarily; the choices  shown  in  the
 implementation  are some of the most appealing ones to us.  Note
 that if both LO and LC are empty, the output will  have  exactly
 as  many  lines as did the input file.  Further note that, while
 these lexemes appearing inside  comments  and  strings  have  no
 influence  on  line  splitting, their presence elsewhere has the
 described effects regardless of the context.

         The reasons for the above choice in the  design  are  as
 follows.  (1) We did not wish to look ahead more than one token.
 This impacts on the expected/required efficiency.  (2) We wished
 to  leave  unchanged  the line splitting choices a user may have
 made in his Pascal program, as far as possible.  The program may
 split  a  user's  input line into more than one output line, but
 never join two or more input lines.


