Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.html


<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 1.4  Left Margin</h3>
<div class="outline-text-3" id="text-4-5">
<p>
        In a way  the  whole  purpose  of  this  program  is  to
determine the left margin lengths of various lines.  It is clear
that the left margin of an output line must depend (at least) on
the  sequence of tokens above this line.  Whether it should also
depend to some extent on the tokens making up that  output  line
needs some analysis.
</p>

<p>
        Our specification requires that the matching UNTIL of  a
REPEAT  be aligned with the REPEAT.  In addition, the UNTIL must
begin a new line.  Thus, the left margin of  a  line  containing
UNTIL  depends  not  only  on the previous line, but also on the
fact that it begins with an UNTIL.
</p>

<p>
Suppose our specification did not require an UNTIL  to  start  a
new  line.   How  should a line "until b1 until b2 until b3;" be
indented?  In this case, we felt it unreasonable  to  align  the
first  until with the outermost repeat.  This example influenced
us to want the left margin of an output line to be determined by
the  first  token  on  that  line,  rather than allowing all the
tokens on that line affect it.  On the other hand, such reserved
words should be line opening words.  With a properly chosen line
opening tokens, this design choice has not much effect.
</p>

<p>
There are other similar situations (e.g., declarations), and our
design   has   to  cater  for  this  general  situation  keeping
enhanceability in mind.
</p>

<p>
        In our design, there are two variables named nmg and cmg
whose  values  depend  on  the  reduced  token sequence, and the
current token we have.  Their names can perhaps be better chosen
but  for the fact that the computation of their values is rather
subtle.  The names are intended to  suggest  'next  margin'  and
'current margin', which are close but inaccurate descriptions of
their values.
</p>

<p>
Nmg gives the cumulative effect on the left margin  of  all  the
tokens  seen  so far, without regard to what the very next token
might be.  Cmg gives the left margin of the output line   if  it
were  the  case  that  the current token begins it.  The current
token does indeed begin the output line either  (a)  because  it
does  so in the corresponding input line or (b) because it is in
LO, or (c) because the preceding token was in LC.
</p>

<p>
        The actual margin value that the output module  uses  is
given  by  the variable called mg.  This equals the nmg in cases
(a) and (c) and the cmg in the case (b).
</p>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 2  Overview of the Design</h3>
<div class="outline-text-3" id="text-4-6">
<p>
        The program is organized as a set of four  modules:  io,
lex,  stack,  and  indent.   All input/output is done via the io
module.  The lex module invokes the io to read  one  line  at  a
time  into  a  buffer, and produces a token stream.  Indent uses
these tokens one at a time and determines the indentation to  be
done.
</p>


<div class="org-src-container">

<pre class="src src-text">                 INDENT
                   |
                   |
                  LEX        STACK
                   |
     mg,nmg        |        buffer
                   |
                   |
text input ======&gt; IO ======&gt; text output

  Figure 3 : Overview of Program Indent
</pre>
</div>

<p>
In doing this, it may examine the entire contents of  the  stack
and  perhaps  push  or  pop  elements from it.  Output of a line
occurs either when a new line is read by  lex,  or  when  indent
decides that the next token should be the beginning of a line.
</p>
</div>
</div>


<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> I2.1  The Buffer and its Indices</h3>
<div class="outline-text-3" id="text-4-7">
<p>
        This consists of an array [0..cxMAX] of characters,  and
the  index  variables  shown below.  Only the io and lex modules
use the buffer.  A line of input text is read into the buffer by
io  module.   Lex tokenizes this text.  The io module is careful
when reading longer than cxMAX lines.  The buffer is used  in  a
very disciplined way described below:
</p>

<div class="org-src-container">

<pre class="src src-text">  |-has been-| |- processed -| |-current-| | yet to be |
     output        by lex        token       processed
|-|----...---|-|-----...-----|-|---...---|-|----...----|-...-|
0 1            f             t             n           l     c
               r             o             e           a     x
               o             x             x           s     M
               m                           t           t     A
               x                           x           x     X

                   Figure 4 : The Line Buffer
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> 2.2  Lexical Equivalence of I/O</h3>
<div class="outline-text-3" id="text-4-8">
<p>
        This is a sketch showing that the input and  output  are
lexically equivalent.
</p>

<p>
        The buffer (Figure 4) is filled with an  input  line  by
readline of io.  All other routines have only 'read-only' access
to  the  buffer.   Printline  of  io  prints  the  contents   of
buffer[fromx  ..  tox], if fromx &lt;= tox, and sets fromx to tox +
</p>
<ol class="org-ol">
<li>Since printline alters no other indices of the buffer, calls
</li>
</ol>
<p>
to  printline  never  cause any part of the buffer to be printed
more than once.  On the other hand, every call  to  readline  &#x2013;
except the very first one &#x2013; is preceded by a call to printline.
As we shall see later, it is the case that tox = lastx prior  to
such  calls.  Thus, no remainder of a line that is read into the
buffer goes unprinted.
</p>

<p>
        That fromx and tox never index  into  the  middle  of  a
token  follows  from the lex module.  That all the input file is
in fact inputted follows from module indent.
</p>

<p>
        Thus all of the input file  is  indeed  output,  perhaps
with new line breaks inserted between tokens.
</p>
</div>
</div>


<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> 2.3  Margin Variables</h3>
<div class="outline-text-3" id="text-4-9">
<p>
         Nmg, at any instant, gives the left margin of the  line
of  output  containing  the next token, if (a) the current token
were such that either it is the last one in that  buffer  or  it
must  close  a  line,  (b)  the next token is an ordinary token.
This holds regardless of what indentation effect is dictated  by
the current token.
</p>

<p>
         Cmg gives  the  left  margin  of  the  line  of  output
containing  the  current  token,  if the current token were such
that it must begin a new line of output (if necessary by forcing
the output of buffer[fromx ..  tox] as a complete line).
</p>

<p>
Note that both nmg and cmg are referring to the values  of  left
margins  that  lines yet to be output will have provided certain
conditions are met.
</p>

<p>
        In contrast, mg gives the left margin of the  next  line
of output, viz., buffer[fromx .. tox].
</p>
</div>
</div>
