Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
** 2.4  Computing the Indentation

         Only the basic idea of our design, and  pertinent  facts
 of  Pascal  syntax  are described below.  (The details should be
 obvious from the implementation.)

         If the current token is neither a reserved word,  nor  a
 delimiter, it has no effect on indentation.

         Suppose it is the reserved word REPEAT.   The  token  --
 not the lexeme "repeat" -- along with the ruling margin (nmg) is
 stacked, and the  margin  is  incremented  by  one  level.   The
 matching  UNTIL  causes  unstacking  until the opening REPEAT is
 found and the margin is reset to the ruling margin prior to  the
 occurence of this REPEAT.

 Tokens "(", CASE,  DO,  THEN,  RECORD,  and  COLON  are  treated
 exactly  the  same way.  We have chosen to use the DO instead of
 the WHILE, or FOR both because it is simple, and because of  the
 specifications.

         The treatment of most other reserved words and delimters
 is similar to the above, except that their "closing brackets" do
 not uniquely determine the "opening" token.   For  example,  the
 SEMICOLON  may  be closing off a while statement, the then-part,
 or the else-part of an if statement, or one of the  cases  in  a
 case statement; the END may be closing off a BEGIN, a CASE, or a
 RECORD.

         The reserved  words  VAR,  PROCEDURE,  FUNCTION,  LABEL,
 CONST,  and  TYPE  need  to  be  treated in a special manner for
 several reasons:

 (1) All these can start sequences of declarations.  But only the
 first three in this list can appear in a parameter list.

 (2) The end of label, const and type declartions is signaled not
 by  a  closing  bracket, but by the occurence of one of the same
 tokens.  The end of var declarations is signaled by a procedure,
 function, or begin.

 (3) Procedures and functions nest, while the others in this list
 do not.

 When the stack top contain a left parenthesis and current  token
 is one of these, they can be ignored because of (1).  Because of
 (2), it is not necessary to distinguish between these tokens; so
 a special DECL token is stacked, unless one kind of declarations
 is being ended to start the next kind (e.g., consts followed  by
 types).  In addition to this, a PF token is stacked if the token
 is a procedure or function, because of (3).  The token BEGIN  --
 that normally acts as an "opening" bracket -- unstacks the (DECL
 and) PF from the top of the stack.

         The token OF also needs special treatment because it can
 appear in declarations of types.  If the stack top is a CASE and
 a COLON is immediately below it, and then  an  OF  occurs,  this
 clearly  must be part of a variant declaration of a record; else
 the OF signals the beginning of case-lists of a case-statement.


** 3  Detailed Design

** 3.1  Properties of the Buffer

         The  buffer[ 0]  is  used  only   by   (this   particular
 implementation  of) io as a sentinel and it must be a non-white.
 Once it is set, it is never changed by any module.  On the other
 hand,  the  presence  of  buffer[ 0]  has  made  many  assertions
 simpler.  In particular, we note that lastx can equal zero.

         The current lexeme is in buffer [tox+1 ..  nextx-1].  It
 will be the last one in the buffer if nextx = lastx+1.  The next
 lexeme begins at buffer[nextx + i], for some i (because of white
 space), if the current lexeme is not the last one; otherwise, it
 begins on the next input  line  which  will  be  read  into  the
 buffer.                     The  next line of output consists of
 buffer [fromx .. tox] certainly, and may possibly be followed by
 buffer [tox+1 .. ?].  Whether this appendage of buffer[tox .. ?]
 is done or not depends on the current lexeme.

 Consider the following relationships:

  (a)     1 <= fromx <= tox+1 <= nextx <= lastx+1 <= cxMAX\\
  (b)     1  = fromx  = tox+1  = nextx\\
  (c)          fromx  = tox+1\\
  (d)                   tox+1 <  nextx <= lastx+1 <= cxMAX\\


 The relationships (a) always hold throughout the program.

 Right after a new line has been read, fromx, tox and  nextx  are
 reset  so  that  (b)  holds.   The  characters  read  are now in
 buffer[ 0..lastx].  The io module truncates long input  lines  to
 cxMAX-long.   Trailing  white  space  is  removed;  thus,  it is
 guaranteed that buffer[lastx] is non-white and buffer[lastx+1] =
 end-of-line  character.   The  index  lastx  can  be equal to 0,
 indicating that the line just  read  was  all-white.   Buffer[ 1]
 will be ascii NUL if end of input file is recognized.

** Immediately after a (part of) line is output, fromx  is  updated
 so (c) holds.

 Calling lex to deliver  the  next  lexeme  causes  nextx  to  be
 increased  so  that  (d)  holds, and the characters constituting
 this lexeme are buffer[tox+1 .. nextx-1].  Buffer[nextx]  is  to
 the  immediate  right of the lexeme; it is the next character to
 be looked at.


** 3.2  io Module

 This module has two procedures: readline, and printline.

         Readline reads one character at a  time  (until  end-of-
 line)  from  the  input  text  file,  and  puts them in the line
 buffer.  It 'truncates' the  line,  if  longer  than  cxMAX,  to
 cxMAX-characters.   Independently of this, it trims the trailing
 blanks, and sets the indices so that:

 (a)     1  = fromx  = tox+1  = nextx <= lastx+1 <= cxMAX\\
 (b)     buffer[lastx]   is non-white\\
 (c)     buffer[lastx+1] is newline character\\
 (d)     buffer[1..lastx] = trimmed input line just read\\


 Only the initlex, and nexttoken procedures of  lex  module  call
 readline.  Printline is called only by nexttoken, and newline of
 lex.


** 3.3  lex Module

         Function nexttoken is the central one  in  this  module.
 The others are newline, first-token-in-line and initlex.

         Procedure  initlex  simply  calls  readline  of  the  io
 module.

         Function first-token-in-line returns true iff  the  last
 lexeme  delivered  (by  nexttoken, of course) is going to be the
 first one in the line to be printed next.

         Procedure newline calls  printline,  if  necessary  (and
 causes  buffer  [fromx  .. tox] to be printed), so that the last
 lexeme delivered becomes the first lexeme in line.

         Function nexttoken delivers the next lexeme in the  line
 buffer.  If the line is exhausted (i.e., nextx > lastx) already,
 it calls printline and then calls readline  to  input  the  next
 line.  If the white-space trimmed input line is empty (i.e., 1 =
 nextx > lastx = 0), it repeats this process  until  a  non-empty
 trimmed line is read in.

 The next lexeme is then found; it is in buffer[nextx ..  tox-1].
 The lexeme is then classified into a token.

 Note that the end-of-file condition  results  in  1  =  nextx  =
 lastx; in this situation, nexttoken delivers the EOFTKN.

         Procedure initlex is included for the  sole  purpose  of
 isolating  the  indent  module  from  io.   Initlex is called by
 indent during initialization, and hence causes  the  very  first
 line of the input file to be read.


