Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.html


<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> 2.4  Computing the Indentation</h3>
<div class="outline-text-3" id="text-4-10">
<p>
        Only the basic idea of our design, and  pertinent  facts
of  Pascal  syntax  are described below.  (The details should be
obvious from the implementation.)
</p>

<p>
        If the current token is neither a reserved word,  nor  a
delimiter, it has no effect on indentation.
</p>

<p>
        Suppose it is the reserved word REPEAT.   The  token  &#x2013;
not the lexeme "repeat" &#x2013; along with the ruling margin (nmg) is
stacked, and the  margin  is  incremented  by  one  level.   The
matching  UNTIL  causes  unstacking  until the opening REPEAT is
found and the margin is reset to the ruling margin prior to  the
occurence of this REPEAT.
</p>

<p>
Tokens "(", CASE,  DO,  THEN,  RECORD,  and  COLON  are  treated
exactly  the  same way.  We have chosen to use the DO instead of
the WHILE, or FOR both because it is simple, and because of  the
specifications.
</p>

<p>
        The treatment of most other reserved words and delimters
is similar to the above, except that their "closing brackets" do
not uniquely determine the "opening" token.   For  example,  the
SEMICOLON  may  be closing off a while statement, the then-part,
or the else-part of an if statement, or one of the  cases  in  a
case statement; the END may be closing off a BEGIN, a CASE, or a
RECORD.
</p>

<p>
        The reserved  words  VAR,  PROCEDURE,  FUNCTION,  LABEL,
CONST,  and  TYPE  need  to  be  treated in a special manner for
several reasons:
</p>

<p>
(1) All these can start sequences of declarations.  But only the
first three in this list can appear in a parameter list.
</p>

<p>
(2) The end of label, const and type declartions is signaled not
by  a  closing  bracket, but by the occurence of one of the same
tokens.  The end of var declarations is signaled by a procedure,
function, or begin.
</p>

<p>
(3) Procedures and functions nest, while the others in this list
do not.
</p>

<p>
When the stack top contain a left parenthesis and current  token
is one of these, they can be ignored because of (1).  Because of
(2), it is not necessary to distinguish between these tokens; so
a special DECL token is stacked, unless one kind of declarations
is being ended to start the next kind (e.g., consts followed  by
types).  In addition to this, a PF token is stacked if the token
is a procedure or function, because of (3).  The token BEGIN  &#x2013;
that normally acts as an "opening" bracket &#x2013; unstacks the (DECL
and) PF from the top of the stack.
</p>

<p>
        The token OF also needs special treatment because it can
appear in declarations of types.  If the stack top is a CASE and
a COLON is immediately below it, and then  an  OF  occurs,  this
clearly  must be part of a variant declaration of a record; else
the OF signals the beginning of case-lists of a case-statement.
</p>
</div>
</div>


<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="section-number-3">4.11</span> 3  Detailed Design</h3>
</div>

<div id="outline-container-sec-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="section-number-3">4.12</span> 3.1  Properties of the Buffer</h3>
<div class="outline-text-3" id="text-4-12">
<p>
        The  buffer[ 0]  is  used  only   by   (this   particular
implementation  of) io as a sentinel and it must be a non-white.
Once it is set, it is never changed by any module.  On the other
hand,  the  presence  of  buffer[ 0]  has  made  many  assertions
simpler.  In particular, we note that lastx can equal zero.
</p>

<p>
        The current lexeme is in buffer [tox+1 ..  nextx-1].  It
will be the last one in the buffer if nextx = lastx+1.  The next
lexeme begins at buffer[nextx + i], for some i (because of white
space), if the current lexeme is not the last one; otherwise, it
begins on the next input  line  which  will  be  read  into  the
buffer.                     The  next line of output consists of
buffer [fromx .. tox] certainly, and may possibly be followed by
buffer [tox+1 .. ?].  Whether this appendage of buffer[tox .. ?]
is done or not depends on the current lexeme.
</p>

<p>
Consider the following relationships:
</p>

<p>
(a)     1 &lt;= fromx &lt;= tox+1 &lt;= nextx &lt;= lastx+1 &lt;= cxMAX<br  />
  (b)     1  = fromx  = tox+1  = nextx<br  />
  (c)          fromx  = tox+1<br  />
  (d)                   tox+1 &lt;  nextx &lt;= lastx+1 &lt;= cxMAX<br  />
</p>


<p>
The relationships (a) always hold throughout the program.
</p>

<p>
Right after a new line has been read, fromx, tox and  nextx  are
reset  so  that  (b)  holds.   The  characters  read  are now in
buffer[ 0..lastx].  The io module truncates long input  lines  to
cxMAX-long.   Trailing  white  space  is  removed;  thus,  it is
guaranteed that buffer[lastx] is non-white and buffer[lastx+1] =
end-of-line  character.   The  index  lastx  can  be equal to 0,
indicating that the line just  read  was  all-white.   Buffer[ 1]
will be ascii NUL if end of input file is recognized.
</p>
</div>
</div>

<div id="outline-container-sec-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="section-number-3">4.13</span> Immediately after a (part of) line is output, fromx  is  updated</h3>
<div class="outline-text-3" id="text-4-13">
<p>
so (c) holds.
</p>

<p>
Calling lex to deliver  the  next  lexeme  causes  nextx  to  be
increased  so  that  (d)  holds, and the characters constituting
this lexeme are buffer[tox+1 .. nextx-1].  Buffer[nextx]  is  to
the  immediate  right of the lexeme; it is the next character to
be looked at.
</p>
</div>
</div>


<div id="outline-container-sec-4-14" class="outline-3">
<h3 id="sec-4-14"><span class="section-number-3">4.14</span> 3.2  io Module</h3>
<div class="outline-text-3" id="text-4-14">
<p>
This module has two procedures: readline, and printline.
</p>

<p>
        Readline reads one character at a  time  (until  end-of-
line)  from  the  input  text  file,  and  puts them in the line
buffer.  It 'truncates' the  line,  if  longer  than  cxMAX,  to
cxMAX-characters.   Independently of this, it trims the trailing
blanks, and sets the indices so that:
</p>

<p>
(a)     1  = fromx  = tox+1  = nextx &lt;= lastx+1 &lt;= cxMAX<br  />
 (b)     buffer[lastx]   is non-white<br  />
 (c)     buffer[lastx+1] is newline character<br  />
 (d)     buffer[1..lastx] = trimmed input line just read<br  />
</p>


<p>
Only the initlex, and nexttoken procedures of  lex  module  call
readline.  Printline is called only by nexttoken, and newline of
lex.
</p>
</div>
</div>


<div id="outline-container-sec-4-15" class="outline-3">
<h3 id="sec-4-15"><span class="section-number-3">4.15</span> 3.3  lex Module</h3>
<div class="outline-text-3" id="text-4-15">
<p>
        Function nexttoken is the central one  in  this  module.
The others are newline, first-token-in-line and initlex.
</p>

<p>
        Procedure  initlex  simply  calls  readline  of  the  io
module.
</p>

<p>
        Function first-token-in-line returns true iff  the  last
lexeme  delivered  (by  nexttoken, of course) is going to be the
first one in the line to be printed next.
</p>

<p>
        Procedure newline calls  printline,  if  necessary  (and
causes  buffer  [fromx  .. tox] to be printed), so that the last
lexeme delivered becomes the first lexeme in line.
</p>

<p>
        Function nexttoken delivers the next lexeme in the  line
buffer.  If the line is exhausted (i.e., nextx &gt; lastx) already,
it calls printline and then calls readline  to  input  the  next
line.  If the white-space trimmed input line is empty (i.e., 1 =
nextx &gt; lastx = 0), it repeats this process  until  a  non-empty
trimmed line is read in.
</p>

<p>
The next lexeme is then found; it is in buffer[nextx ..  tox-1].
The lexeme is then classified into a token.
</p>

<p>
Note that the end-of-file condition  results  in  1  =  nextx  =
lastx; in this situation, nexttoken delivers the EOFTKN.
</p>

<p>
        Procedure initlex is included for the  sole  purpose  of
isolating  the  indent  module  from  io.   Initlex is called by
indent during initialization, and hence causes  the  very  first
line of the input file to be read.
</p>
</div>
</div>
