Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
** 3.4  stack Module

         Our stack module contains 5 procedures and  a  function.
 The  function stackhas makes this module an "impure" stack.  The
 types parameters of the routines are described below.  Note that
 each  element  of  the stack is a pair of token (not lexeme) and
 margin.

         t       : token\\
         m       : margin\\
         sot     : set of token\\

 Procedure stack(t, m) stacks [i.e., pushes] the (t, m) pair.  It
 checks for overflow of the stack.

 Procedure unstack unstacks (i.e., pops) the top-most element  of
 the stack.  It checks for stack being empty before unstacking.

 Procedure stktop(var t, var m) returns the top-most  element  of
 the stack in t and m.  The stack remains unaffected.

 Procedure unstackuntil(sot, var m) repeatedly unstacks  until  a
 token  in  sot is popped from the stack.  The corresponding m is
 returned.  The stack may become empty as result of calling  this
 procedure.

 Procedure unstackwhile(sot, var m)  unstacks  while  the  tokens
 being  popped from the stack are in sot.  The m corresponding to
 the last popped element is returned.  It  is  possible  that  no
 elements  are  popped  because the very top-most token is not in
 sot; in this case m remains UNaltered.

 Function stackhas(sot) returns true iff  the  stack  contains  a
 token from the set sot.  The stack itself remains unaltered.


** 3.7  indent Module

         An outline of the module is given below:

   #+begin_src pseudo
 initialize lex module;
 { token sequence processed so far, T := null; }
 repeat
         t := next token;
         compute reduced sequence and margins;
         if t is a Line Opener then end the previous line  fi;
         if t is a Line Closer then
                 skip over comments;     { t may change }
                 end the current line;
         fi
         { T := T.t }
 until t = EOFtoken
#+end_src

** 3.2  Compute Reduced Sequence and Margins

         This  is  accomplished  by  using  a  rather  long  case
 statement, and literally following the definition of the reduced
 sequence.  For short we will call this program segment CRSM.

 The margin variables mg, and nmg are used only by the  printline
 procedure  of  io,  and by the indent module (of which CRSM is a
 part).  There is also a cmg used locally by indent module.

 Assume that before each execution of CRSM the following holds:


 (0) Let T be the token sequence processed so far;

 (1) Stack has p >  0 elements;

 (2) Stack[1..p] contains the reduced token sequence RED(T);

 (3) The margin value contained in the i-th (from bottom) element
 of  the  stack  is  the  NMG-value  for  the  token  sequence of
 stack[1..i-1], for all i, 1 <  i <  p.

 (4) cmg = nmg = NMG-value of T.

 Initially the above is vacuously true with p = 0.  Let t be  the
 current token.  If consequent stacking and/or unstacking is done
 so that the above hold with T.t replacing  T,  these  properties
 become an invariant of the loop shown.





*  Implementation

 The indenting program has been implemented in  Standard  Pascal,
 UCSD  Pascal,  and C.  This section discusses the details of how
 the design described in the  previous  section  is  mapped  into
 these languages.  Unless otherwise stated, statements being made
 below apply to both versions.  While reading  certain  parts  of
 this  section, it is necessary to have a listing of the programs
 along side.


 >>  Where  should  one  draw  a  line  separating  design   from
 implementation  is  open for discussion.  Here, we have used two
 criteria. (1) If certain restructuring is caused only because of
 the  language  in  which the program is coded, the discussion of
 that  restructuring  certainly  belongs  in  the  implementation
 section. (2)  Local changes (say inside a routine) of the design
 also belong here.  <<

** 1  Some Global Considerations

 Tokens == Symbols

         The tokens are collected into an enumeration type called
 "symbol".   This  is so declared in the Pascal version.  We make
 them #define'd constants in the C version.  >> At the time  this
 program was written, C did not have an enum type. <<

 Upper/Lower Case

         Obviously no case change should be performed from  input
 to  output.   The  question  is with regard to 'reserved words.'
 Because  it  is  both  simple  and  less  confusing,   in   this
 implementation  we chose to check if a lexeme is a reserved word
 after all its characters have been converted into lower case.

 Long Lines

         A typical input line is expected to be  no  longer  than
 CXmax, which is user-customizable, reasonable values being > 82.
 Lines longer than CXmax are truncated  to  this  length.   As  a
 result,  it  is  almost  always  the  case that the meaning of a
 program changes, if it has abnormally long input lines.

 Deep Nesting

         The max output line length is given by  OUTLLmax,  which
 includes the white space in front of the line.  Deep nesting can
 cause the white space to be so large that  the  entire  line  is
 longer  than  OUTLLmax.   Such  a  line  is  printed without any
 leading white space.


** 2  Initialization

         Our design requires a few  non-atomic  constants,  which
 are  not  easy to set up in Pascal.  In C, this can be done with
 greater  ease,  as  static  initializations.   Neither  language
 permits  us to state that these composite constants be used only
 as constants and not as variables.

         Our design uses these structured constants:

         LineOpeners     : set of token;\\
         LineClosers     : set of token;\\
         Delimiters      : set of character;\\
         UClc            : array [char] of char; { upper case to lc }\\
         LexTkn          : array [1..46] of <lexeme, token>;\\
         Index           : array [0..9] of 1..46;\\

         The LineOpeners and LineClosers  are  user-customizable.
 The Delimiters is initialized to contain the standard delimiters
 of Pascal (sans the arithmetic operators, and  brackets  --  see
 3.1.1 Tokens).  In the Pascal version, this is done by procedure
 initialize; this procedure, except for the last line, is done in
 the C version as static initializations.

         Note that the very first input line needs to be  read-in
 by  calling  readline of io module.  Readline uses the fact that
 buffer[ 0] is non-white.  Apart from this, the order in which the
 above initialization is performed is immaterial.


** 3  lex Module

