Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.html


<div id="outline-container-sec-4-16" class="outline-3">
<h3 id="sec-4-16"><span class="section-number-3">4.16</span> 3.4  stack Module</h3>
<div class="outline-text-3" id="text-4-16">
<p>
        Our stack module contains 5 procedures and  a  function.
The  function stackhas makes this module an "impure" stack.  The
types parameters of the routines are described below.  Note that
each  element  of  the stack is a pair of token (not lexeme) and
margin.
</p>

<p>
t       : token<br  />
         m       : margin<br  />
         sot     : set of token<br  />
</p>

<p>
Procedure stack(t, m) stacks [i.e., pushes] the (t, m) pair.  It
checks for overflow of the stack.
</p>

<p>
Procedure unstack unstacks (i.e., pops) the top-most element  of
the stack.  It checks for stack being empty before unstacking.
</p>

<p>
Procedure stktop(var t, var m) returns the top-most  element  of
the stack in t and m.  The stack remains unaffected.
</p>

<p>
Procedure unstackuntil(sot, var m) repeatedly unstacks  until  a
token  in  sot is popped from the stack.  The corresponding m is
returned.  The stack may become empty as result of calling  this
procedure.
</p>

<p>
Procedure unstackwhile(sot, var m)  unstacks  while  the  tokens
being  popped from the stack are in sot.  The m corresponding to
the last popped element is returned.  It  is  possible  that  no
elements  are  popped  because the very top-most token is not in
sot; in this case m remains UNaltered.
</p>

<p>
Function stackhas(sot) returns true iff  the  stack  contains  a
token from the set sot.  The stack itself remains unaltered.
</p>
</div>
</div>


<div id="outline-container-sec-4-17" class="outline-3">
<h3 id="sec-4-17"><span class="section-number-3">4.17</span> 3.7  indent Module</h3>
<div class="outline-text-3" id="text-4-17">
<p>
An outline of the module is given below:
</p>

<div class="org-src-container">

<pre class="src src-pseudo">initialize lex module;
{ token sequence processed so far, T := null; }
repeat
        t := next token;
        compute reduced sequence and margins;
        if t is a Line Opener then end the previous line  fi;
        if t is a Line Closer then
                skip over comments;     { t may change }
                end the current line;
        fi
        { T := T.t }
until t = EOFtoken
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-18" class="outline-3">
<h3 id="sec-4-18"><span class="section-number-3">4.18</span> 3.2  Compute Reduced Sequence and Margins</h3>
<div class="outline-text-3" id="text-4-18">
<p>
        This  is  accomplished  by  using  a  rather  long  case
statement, and literally following the definition of the reduced
sequence.  For short we will call this program segment CRSM.
</p>

<p>
The margin variables mg, and nmg are used only by the  printline
procedure  of  io,  and by the indent module (of which CRSM is a
part).  There is also a cmg used locally by indent module.
</p>

<p>
Assume that before each execution of CRSM the following holds:
</p>


<p>
(0) Let T be the token sequence processed so far;
</p>

<p>
(1) Stack has p &gt;  0 elements;
</p>

<p>
(2) Stack[1..p] contains the reduced token sequence RED(T);
</p>

<p>
(3) The margin value contained in the i-th (from bottom) element
of  the  stack  is  the  NMG-value  for  the  token  sequence of
stack[1..i-1], for all i, 1 &lt;  i &lt;  p.
</p>

<p>
(4) cmg = nmg = NMG-value of T.
</p>

<p>
Initially the above is vacuously true with p = 0.  Let t be  the
current token.  If consequent stacking and/or unstacking is done
so that the above hold with T.t replacing  T,  these  properties
become an invariant of the loop shown.
</p>
</div>
</div>
</div>





<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Implementation</h2>
<div class="outline-text-2" id="text-5">
<p>
The indenting program has been implemented in  Standard  Pascal,
UCSD  Pascal,  and C.  This section discusses the details of how
the design described in the  previous  section  is  mapped  into
these languages.  Unless otherwise stated, statements being made
below apply to both versions.  While reading  certain  parts  of
this  section, it is necessary to have a listing of the programs
along side.
</p>


<p>
&gt;&gt;  Where  should  one  draw  a  line  separating  design   from
implementation  is  open for discussion.  Here, we have used two
criteria. (1) If certain restructuring is caused only because of
the  language  in  which the program is coded, the discussion of
that  restructuring  certainly  belongs  in  the  implementation
section. (2)  Local changes (say inside a routine) of the design
also belong here.  &lt;&lt;
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 1  Some Global Considerations</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Tokens == Symbols
</p>

<p>
        The tokens are collected into an enumeration type called
"symbol".   This  is so declared in the Pascal version.  We make
them #define'd constants in the C version.  &gt;&gt; At the time  this
program was written, C did not have an enum type. &lt;&lt;
</p>

<p>
Upper/Lower Case
</p>

<p>
        Obviously no case change should be performed from  input
to  output.   The  question  is with regard to 'reserved words.'
Because  it  is  both  simple  and  less  confusing,   in   this
implementation  we chose to check if a lexeme is a reserved word
after all its characters have been converted into lower case.
</p>

<p>
Long Lines
</p>

<p>
        A typical input line is expected to be  no  longer  than
CXmax, which is user-customizable, reasonable values being &gt; 82.
Lines longer than CXmax are truncated  to  this  length.   As  a
result,  it  is  almost  always  the  case that the meaning of a
program changes, if it has abnormally long input lines.
</p>

<p>
Deep Nesting
</p>

<p>
        The max output line length is given by  OUTLLmax,  which
includes the white space in front of the line.  Deep nesting can
cause the white space to be so large that  the  entire  line  is
longer  than  OUTLLmax.   Such  a  line  is  printed without any
leading white space.
</p>
</div>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 2  Initialization</h3>
<div class="outline-text-3" id="text-5-2">
<p>
        Our design requires a few  non-atomic  constants,  which
are  not  easy to set up in Pascal.  In C, this can be done with
greater  ease,  as  static  initializations.   Neither  language
permits  us to state that these composite constants be used only
as constants and not as variables.
</p>

<p>
Our design uses these structured constants:
</p>

<p>
LineOpeners     : set of token;<br  />
         LineClosers     : set of token;<br  />
         Delimiters      : set of character;<br  />
         UClc            : array [char] of char; { upper case to lc }<br  />
         LexTkn          : array [1..46] of &lt;lexeme, token&gt;;<br  />
         Index           : array [0..9] of 1..46;<br  />
</p>

<p>
        The LineOpeners and LineClosers  are  user-customizable.
The Delimiters is initialized to contain the standard delimiters
of Pascal (sans the arithmetic operators, and  brackets  &#x2013;  see
3.1.1 Tokens).  In the Pascal version, this is done by procedure
initialize; this procedure, except for the last line, is done in
the C version as static initializations.
</p>

<p>
        Note that the very first input line needs to be  read-in
by  calling  readline of io module.  Readline uses the fact that
buffer[ 0] is non-white.  Apart from this, the order in which the
above initialization is performed is immaterial.
</p>
</div>
</div>
