Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
** 3.1  Next Token of lex Module

         The function nexttoken uses subprocedure gettoken, which
 in  turn  uses  stdtoken.   Gettoken finds the lexeme, and calls
 stdtoken to examine it to see if it is one of  Pascals  reserved
 words,  or  special  symbols.  If it is one of these, it returns
 the corresponding  token.   Otherwise,  it  returns  ordinarySY.
  Stdtoken  uses  constant  tables  LexTkn and Index to determine
 this.  Note that it is necessary to first check for 2-char  long
 special symbols before checking for 1-char long ones; otherwise,
 a lexeme such as := would be tokenized as  colonSY  followed  by
 ordinarySY (for the lexeme '=').

         The lexeme found -- buffer[tox ..  nextx-1]  --  can  be
 part  of  a  comment  or  string,  as  indicated by incomment or
 instring.  Also, the current lexeme can end a comment or string.


** 3.2  Lexeme-Token Tables

         This is a constant table, called LexTkn, of 46  entries.
 Each entry is a pair of lexeme and token.  The lexemes stored in
 this table include all  reserved  words,  and  special-character
 lexemes  (such  as  :=  etc.).  The table is first sorted in the
 increasing order of their length, and then in each  length-group
 (ascii)  alphabetically.   Special-character lexemes are at most
 two-characters in length, and  reserved  words  are  at  most  9
 characters long.

         Associated with this  table  is  another  called  Index.
 This  is  also  a  constant  array,  and  it is set up such that
 Index[i] gives the least index x such that LexTkn[x] contains  a
 lexeme of length i.

         Thus, to check if a given lexeme of length x is  one  of
 these  in LexTkn, we begin looking at LexTkn[ Index[ x]], and do
 not look beyond LexTkn[ Index[ x+1]].  (Hence  Index[ 10]  should
 be  defined.)   Since LexTkn is fully sorted, we could have used
 binary search between these bounds.  However, we do not  believe
 it  would  significantly improve the speed, because Index[i+1] -
 Index[i] is quite small.

 Because C does not permit array-index range to begin  at  1,  we
 let  Index[ 0] go waste in it (and also in the Pascal version for
 uniformity).


** 4  Other Modules

         The modules stack,   and  indent  are  straight  forward
 implementations of the design discussed in the previous section.

         The module io deals  with  system-dependencies  such  as
 end-of-line,  and  end-of-file  which are handled differently in
 the two  versions.   However,  in  both  versions,  the  boolean
 variable  eofile  remains  false immediately after the last line
 has been read; it becomes true after readline attempts to a read
 a (non-existent) line after end-of-file condition is discovered.
 This is necessitated by Pascal  source  that  may  have  a  non-
 terminating  comment,  or  string.   Nexttoken checks eofile and
 would not process further it it is true.


** 5  Comments on the Pascal Version

         The object code of  the  Pascal  version  of  indent  is
 longer  than  that  of the equivalent C version for two reasons:
 (1)  the  constant  tables   are   initialized   by   assignment
 statements;   (2)  the  cases  in  procedure  doindent  are  not
 "reduced" (see the next subsection).

         In Pascal, to detect both end-of-line,  and  end-of-file
 conditions we rely on eoln and eof standard functions.

         Certain Pascal implementations do not allow  a  "set  of
 char".   The Delimiters should then be typed as an "array [char]
 of boolean".  The program assumes that the  underlying  char  is
 ascii.   We  are  not  aware of any other potentially unportable
 features.


** 6  Comments on the C Version

         The design of  indent  uses  sets  extensively.   It  so
 happens that most of our sets are rather small.  The LineOpeners
 and LineClosers contain at most all the symbols; the  Delimiters
 contains at most all ascii chars.

 In the C version, we chose to implement "set of symbol" as a "long
 int" of C.  All the C implementations that we tried this is at least
 32-bit long.  The test for the membership is translated into a
 bit-wise logical-AND (as in "token & (recordSY | caseSY)" ).  Thus,
 each of these symbols is #define'd as a long constant.

 The Delimiters became an array of  booleans.   This  could  have
 been  static  initialized,  but  we took the easier approach and
 initialize it run-time.

         In C, both of end-of-line, and end-of-file are  readable
 as  newline  and -1 (returned by getchar()).  These are inserted
 into the buffer as '\n' and '\0', respectively.

         We tried to improve the speed and decrease the  size  of
 the  object  code  for  the  version.   The  many  cases  in the
 procedure doindent are combined by #defin'ing several  constants
 to have the same value (see file indent.h).  This may have to be
 undone if different set of symbols are used  as  LineOpeners  or
 LineClosers (see Appendix on Customization Notes).




