Courses/7140/Lectures/Examples/Pretty-Printer/ppp-doc.org
*  D. User's Manual


         The program indent,  as  compiled  on  Unix,  reads  the
 (standard)  input file, and outputs to the standard output.  The
 input file is expected to be an ascii text file; however, indent
 does not check this, but is robust enough not to crash in such a
 case.

 Typical invocation on Unix is:

 indent < file1.p > file2.p

         Given that the input contains  a  syntactically  correct
 Pascal  program,  the output produced will be an equivalent text
 file possibly differing from the input only in the white  spaces
 it  contains.   The text in the output file satisfies rigorously
 defined rules of lay out.  These  rules  are  loosely  explained
 below.

         Indent    also    can    deal     with     syntactically
 incorrect/incomplete  Pascal  programs  in  a sensible way.  The
 description of output lay out in this situation, however, is too
 complex to go in a User's Manual.

         The user interested in the rigorous treatment  of  these
 lay  outs  should  refer  to  Section  2 : Specifications of the
 Documentation of Indent.


 D.1  The Lay Out Rules

 (1) The reserved words and other tokens included in  LineOpeners
 always start a new line.  Presently this set consists of:

 const   type    label
 begin   repeat  while   if
 end     until   for     else    case

         If they already were at the beginning of a line  in  the
 input,  that  part  of  the  input line appears unchanged in the
 output.  If they were embedded some where in the  middle  of  an
 input  line,  then the input line will be split up so that these
 tokens are at the beginning of a line in the output.

 (2) The reserved words and tokens included in LineClosers always
 ends a line.    Presently this set is empty.

         Above caveat about  line-splitting  is  applicable  here
 also.   In addition, any comments following the semicolon on the
 same line are retained as they were.

 (3) The various Pascal constructs are laid out in the output  as
 follows.   If the statement contained none of the above reserved
 words, they will begin on a new line only if it already was.

   #+begin_src text
 while  boolean exp  do  |       repeat
         statement       |               statements
                         |       until  boolean exp

 for  var := exp to/downto   exp  do
         statement




 if  bollean exp  then   |       case
         statement       |               value1 :
 else                    |                       statement;
         statement       |               value2, value3 :
                         |                       statement
                         |       end


 (* functions and programs are laid out similarly. *)

 procedure  proc identifier ( parameters );
         var
                 var declarations
         ... internal procedures and functions ...
         begin
         statements
         end;
#+end_src

 (4) Each left parenthesis increases the level of indentation  by
 one.   However, its effect may be unnoticed in the output if the
 closing right parenthesis appears on the same line.

 (5) Comments appearing after a semicolon  are  left  alone.   If
 they  span  multiple  lines, they are left-aligned to align with
 the current statement.


 D.2  Minor Surprises

         Below we list some aspects of the behavior of the indent
 that   would   appear   eccentric.    Unless  you  have  already
 encountered it in your use of indent, we are afraid,  these  may
 not readily be meaningful to you.

 Comments that are begun with a '{' or '(*'  will  be  considered
 closed  by the first occurence of either '}' or '*)'.  No effort
 is made to match the brace-opening comment with a  corresponding
 right brace, or to match with '(*' with '*)' only.

 If the parameter list contains semicolons, layout rule (2)  will
 be applicable.

 Multiple line comments with indentation are stripped  of  it  in
 the output.






*                      E. Customization Notes

         There are a few features of indent that  can  be  easily
 customized.   Change  the  declarations in the source program of
 indent as described here and recompile.

         LineOpeners  and  LineClosers  can  be  changed  to  any
 arbitrary  sets  of symbols.  Delimiters must always include all
 white  characters;   further  delimiters  such   as   arithmetic
 operators, brackets etc. may be added.  See the layout rules (1)
 and (2) of the Users Manual.

         UOI is the unit of  indentation  in  terms  of  INDCHAR.
 These  are  currently 1 and tab character respectively.  UOI can
 be changed to  any  other  positive  integer.   INDCHAR  can  be
 changed  to  any  other  character, but not a string (unless the
 putchar() is changed in the C version).

# Local variables:
# after-save-hook: org-html-export-to-html
# end:
